Backend/app/controllers/parents_controller.rb

  def index
    @parent = Parent.all
---
SELECT "parents".* FROM "parents"

  def create
    parent = Parent.create(parent_params)
---
INSERT INTO "parents" ("name", "petname", "email", "phone", "interest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "asdfasd"], ["petname", "asdfasd"], ["email", "asdf"], ["phone", "asdf"], ["interest", "asdf"], ["created_at", "2018-09-10 22:12:07.013034"], ["updated_at", "2018-09-10 22:12:07.013034"]]